package com.jnf.file.File.array;

 /*
 * 数组的概述
 *   1.数组的理解：数组(Array)，是多个相同类型数据按一定顺序排列的集合，并使用一个名字命名
 *  并通过编号的方式对这些数据进行统一管理
 *
 *   2.数组相关的概念：
 *     数组名
 *     元素
 *     角标，下标，索引
 *     数组的长度：元素的个数
 *
 *   3.数组的特点：
 *   数组是有序排列的
 *   数组属于引用数据类型的变量。数组的元素，即可以是基本数据类型，也可以是引用数据类型
 *   创建数组对象会在内存中开辟一块连续的空间
 *   数组的长度一旦确定，就不能修改
 *
 *   4.数组的分类
 *      按照维数：一维数组，二维数组。。。。
 *      按照数组元素的类型：基本数据类型元素的数组，引用数据类型元素的数组
 *
 *   5.一维数组的使用
 *      一维数组的声明和初始化
 *      如何调用数组的指定位置的元素
 *      如何获取数组的长度
 *      如何遍历数组
 *      数组元素的默认初始化值
 *         数组元素是整性：0
 *         数组元素是浮点型：0.0
 *         数组元素是char型：0或'\u0000'，而非'0'
 *         数组元素是引用数据类型：null
 *      数组的内存解析
*/

 public class ArrayTest {
     public static void main(String[] args) {
       //1.一维数组的声明和初始化
          //1.1静态初始化：数组的初始化和数组元素的赋值操作同时进行
            int[] ids = new int[]{1001,1002,1003,1004};
          //1.2动态初始化：数组的初始化和数组元素的赋值操作分开进行
            String[] names = new String[5] ;
          //总结：数组一旦初始化完成，其长度就确定了

      //2.如何调用数组的指定位置的元素：通过角标的方式调用
         //数组的角标（索引）从0开始的，到数组的长度-1结束
         names[0] = "张三";
         names[1] = "李四";
         names[2] = "王五";
         names[3] = "赵六";
         names[4] = "钱七";
         //names[5] = "钱八";  ///java.lang.ArrayIndexOutOfBoundsException

      //3.如何获取数组的长度
         //属性：length
         System.out.println(names.length);
         System.out.println(ids.length);

      //4.如何遍历数组
         for (int i = 0 ; i < names.length ; i++){
             System.out.println(names[i]);
         }
     }
 }
